function main(npc,player)
    lualib:ShowFormWithContent(player, "form文件表单", "特殊装备");
    return""
end

local type_js = {
    {
        ["0"] = {"斗笠1",50,0,"攻击伤害增加1%","暂无",0},
        ["斗笠1"] = {"斗笠2",100,0,"攻击伤害增加2%","攻击伤害增加1%",0},
        ["斗笠2"] = {"斗笠3",200,0,"攻击伤害增加3%","攻击伤害增加2%",0},
        ["斗笠3"] = {"斗笠4",300,0,"攻击伤害增加4%","攻击伤害增加3%",0},
        ["斗笠4"] = {"斗笠5",500,0,"攻击伤害增加5%","攻击伤害增加4%",0},
        ["斗笠5"] = {"斗笠6",1000,2000,"攻击伤害增加6%","攻击伤害增加5%",0},
        ["斗笠6"] = {"斗笠7",2000,3000,"攻击伤害增加7%","攻击伤害增加6%",0},
        ["斗笠7"] = {"斗笠8",3000,5000,"攻击伤害增加8%","攻击伤害增加7%",0},
        ["斗笠8"] = {"斗笠9",5000,10000,"攻击伤害增加10%","攻击伤害增加8%",0},
        ["斗笠9"] = {"斗笠10",7000,20000,"攻击伤害增加12%","攻击伤害增加10%",0},
        ["斗笠10"] = {"斗笠11",10000,30000,"攻击伤害增加14%","攻击伤害增加12%",0},
        ["斗笠11"] = {"斗笠12",15000,50000,"攻击伤害增加17%","攻击伤害增加14%",0},
        ["斗笠12"] = {"斗笠13",20000,80000,"攻击伤害增加21%","攻击伤害增加17%",0},
        ["斗笠13"] = {"斗笠14",25000,120000,"攻击伤害增加26%","攻击伤害增加21%",0},
        ["斗笠14"] = {"斗笠15",30000,200000,"攻击伤害增加32%","攻击伤害增加26%",0},
        ["斗笠15"] = {"斗笠16",40000,300000,"攻击伤害增加40%","攻击伤害增加32%",0},
        ["斗笠16"] = {"斗笠16",0,0,"攻击伤害增加20%","已达到顶级",0},

    },
    {
        ["0"] = {"符文1",50,0,"攻魔道+1%","暂无",1806300002},
        ["符文1"] = {"符文2",100,0,"攻魔道+2%","攻魔道+1%",1806300003},
        ["符文2"] = {"符文3",200,0,"攻魔道+4%","攻魔道+2%",1806300004},
        ["符文3"] = {"符文4",300,0,"攻魔道+6%","攻魔道+4%",1806300005},
        ["符文4"] = {"符文5",500,0,"攻魔道+8%","攻魔道+6%",1806300006},
        ["符文5"] = {"符文6",1000,2000,"攻魔道+10%","攻魔道+8%",1806300007},
        ["符文6"] = {"符文7",2000,3000,"攻魔道+13%","攻魔道+10%",1806300008},
        ["符文7"] = {"符文8",3000,5000,"攻魔道+16%","攻魔道+13%",1806300008},
        ["符文8"] = {"符文9",5000,10000,"攻魔道+19%","攻魔道+16%",1806300003},
        ["符文9"] = {"符文10",7000,20000,"攻魔道+22%","攻魔道+19%",1806300004},
        ["符文10"] = {"符文11",10000,30000,"攻魔道+25%","攻魔道+22%",1806300005},
        ["符文11"] = {"符文12",15000,50000,"攻魔道+29%","攻魔道+25%",1806300006},
        ["符文12"] = {"符文13",20000,80000,"攻魔道+34%","攻魔道+29%",1806300007},
        ["符文13"] = {"符文14",25000,120000,"攻魔道+40%","攻魔道+34%",1806300008},
        ["符文14"] = {"符文15",30000,200000,"攻魔道+48%","攻魔道+40%",1806300008},
        ["符文15"] = {"符文16",40000,300000,"攻魔道+60%","攻魔道+48%",1806300008},
        ["符文16"] = {"符文16",0,0,"攻魔道+60%","已达到顶级",1806300008},
    },
    {
        ["0"] = {"魔血石1",50,0,"每秒恢复HPMP80点","暂无",1806300002},
        ["魔血石1"] = {"魔血石2",100,0,"每秒恢复HPMP100点","每秒恢复HPMP80点",1806300003},
        ["魔血石2"] = {"魔血石3",200,0,"每秒恢复HPMP120点","每秒恢复HPMP100点",1806300004},
        ["魔血石3"] = {"魔血石4",300,0,"每秒恢复HPMP140点","每秒恢复HPMP120点",1806300005},
        ["魔血石4"] = {"魔血石5",500,0,"每秒恢复HPMP160点","每秒恢复HPMP140点",1806300006},
        ["魔血石5"] = {"魔血石6",1000,2000,"每秒恢复HPMP180点","每秒恢复HPMP160点",1806300007},
        ["魔血石6"] = {"魔血石7",2000,3000,"每秒恢复HPMP200点","每秒恢复HPMP180点",1806300007},
        ["魔血石7"] = {"魔血石8",3000,5000,"每秒恢复HPMP230点","每秒恢复HPMP200点",1806300005},
        ["魔血石8"] = {"魔血石9",5000,10000,"每秒恢复HPMP260点","每秒恢复HPMP230点",1806300006},
        ["魔血石9"] = {"魔血石10",7000,20000,"每秒恢复HPMP290点","每秒恢复HPMP260点",1806300007},
        ["魔血石10"] = {"魔血石11",10000,30000,"每秒恢复HPMP320点","每秒恢复HPMP290点",1806300007},
        ["魔血石11"] = {"魔血石12",15000,50000,"每秒恢复HPMP350点","每秒恢复HPMP320点",1806300007},
        ["魔血石12"] = {"魔血石13",20000,80000,"每秒恢复HPMP380点","每秒恢复HPMP350点",1806300007},
        ["魔血石13"] = {"魔血石14",25000,120000,"每秒恢复HPMP420点","每秒恢复HPMP380点",1806300007},
        ["魔血石14"] = {"魔血石15",30000,200000,"每秒恢复HPMP500点","每秒恢复HPMP420点",1806300007},
        ["魔血石15"] = {"魔血石16",40000,300000,"每秒恢复HPMP600点","每秒恢复HPMP500点",1806300007},
        ["魔血石16"] = {"魔血石16",0,0,"每5秒恢复HPMP350点","已达到顶级",1806300007},
    },
    {
        ["0"] = {"盾牌1",50,0,"生命值增加5%","暂无",1806300002},
        ["盾牌1"] = {"盾牌2",100,0,"生命值增加10%","生命值增加5%",1806300003},
        ["盾牌2"] = {"盾牌3",200,0,"生命值增加15%","生命值增加10%",1806300004},
        ["盾牌3"] = {"盾牌4",300,0,"生命值增加20%","生命值增加15%",1806300005},
        ["盾牌4"] = {"盾牌5",500,0,"生命值增加25%","生命值增加20%",1806300006},
        ["盾牌5"] = {"盾牌6",1000,2000,"生命值增加30%","生命值增加25%",1806300007},
        ["盾牌6"] = {"盾牌7",2000,3000,"生命值增加35%","生命值增加30%",1806300007},
        ["盾牌7"] = {"盾牌8",3000,5000,"生命值增加40%","生命值增加35%",1806300003},
        ["盾牌8"] = {"盾牌9",5000,10000,"生命值增加45%","生命值增加40%",1806300004},
        ["盾牌9"] = {"盾牌10",7000,20000,"生命值增加52%","生命值增加45%",1806300005},
        ["盾牌10"] = {"盾牌11",10000,30000,"生命值增加60%","生命值增加52%",1806300006},
        ["盾牌11"] = {"盾牌12",15000,50000,"生命值增加68%","生命值增加60%",1806300007},
        ["盾牌12"] = {"盾牌13",20000,80000,"生命值增加76%","生命值增加68%",1806300007},
        ["盾牌13"] = {"盾牌14",25000,120000,"生命值增加85%","生命值增加76%",1806300003},
        ["盾牌14"] = {"盾牌15",30000,200000,"生命值增加100%","生命值增加85%",1806300004},
        ["盾牌15"] = {"盾牌16",40000,300000,"生命值增加120%","生命值增加100%",1806300005},
        ["盾牌16"] = {"盾牌16",0,0,"生命值增加120%","已达到顶级",1806300005},
    },
    {
        ["0"] = {"翅膀1",50,0,"对怪物伤害提升1%","暂无",1806300002},
        ["翅膀1"] = {"翅膀2",100,0,"对怪物伤害提升2%","对怪物伤害提升1%",1806300003},
        ["翅膀2"] = {"翅膀3",200,0,"对怪物伤害提升3%","对怪物伤害提升2%",1806300004},
        ["翅膀3"] = {"翅膀4",300,0,"对怪物伤害提升4%","对怪物伤害提升3%",1806300005},
        ["翅膀4"] = {"翅膀5",500,0,"对怪物伤害提升5%","对怪物伤害提升4%",1806300006},
        ["翅膀5"] = {"翅膀6",1000,1000,"对怪物伤害提升7%","对怪物伤害提升5%",1806300007},
        ["翅膀6"] = {"翅膀7",2000,2000,"对怪物伤害提升9%","对怪物伤害提升7%",1806300007},
        ["翅膀7"] = {"翅膀8",3000,3000,"对怪物伤害提升12%","对怪物伤害提升9%",1806300003},
        ["翅膀8"] = {"翅膀9",5000,5000,"对怪物伤害提升15%","对怪物伤害提升12%",1806300004},
        ["翅膀9"] = {"翅膀10",7000,10000,"对怪物伤害提升18%","对怪物伤害提升15%",1806300005},
        ["翅膀10"] = {"翅膀11",10000,20000,"对怪物伤害提升21%","对怪物伤害提升18%",1806300006},
        ["翅膀11"] = {"翅膀12",15000,30000,"对怪物伤害提升24%","对怪物伤害提升21%",1806300007},
        ["翅膀12"] = {"翅膀13",20000,50000,"对怪物伤害提升28%","对怪物伤害提升24%",1806300007},
        ["翅膀13"] = {"翅膀14",25000,100000,"对怪物伤害提升34%","对怪物伤害提升28%",1806300003},
        ["翅膀14"] = {"翅膀15",30000,200000,"对怪物伤害提升40%","对怪物伤害提升34%",1806300004},
        ["翅膀15"] = {"翅膀16",40000,300000,"对怪物伤害提升48%","对怪物伤害提升40%",1806300005},
        ["翅膀16"] = {"翅膀16",0,0,"对怪物伤害提升48%","已达到顶级",1806300006},

    },
}
local wei = {19,21,422,17,14}
local cl = {"莫邪之血","莫邪之血","莫邪之血","莫邪之血","莫邪之血"}

function huoqu(player,num)
    local num = tonumber(num)
    if num < 0 or num > #wei then
        lualib:MsgBox(player,"系统错误请从新打开.")
        return""
    end
    local az = "0"
    local item_site = lualib:Player_GetItemGuid(player,wei[num])
    if item_site ~= "" then
        az = lualib:KeyName(item_site)
    end
    local str = "TSSystem_gengxin(\""..az.."\")";
    lualib:ShowFormWithContent(player, "脚本表单", str);
    return""
end

function duanzao(player,num)
    local num = tonumber(num)
    if type_js[num] == nil then
        lualib:MsgBox(player,"系统错误请从新打开！")
        return""
    end
    if lualib:GetBagFree(player) < 2 then
        lualib:MsgBox(player,"请留2个包裹空间")
        return ""
    end
    local az = "0"
    local item_site = lualib:Player_GetItemGuid(player,wei[num])
    if item_site ~= "" then
        az = lualib:KeyName(item_site)
    end
    if type_js[num][az] == nil then
        lualib:MsgBox(player,"系统错误请从新打开！")
        return""
    end
    local t = type_js[num][az]
    if t[1] == az then
        lualib:MsgBox(player,"当前装备已满阶段！无需进阶")
        return""
    end
    if lualib:ItemCount(player, cl[num]) < t[2] then
        lualib:MsgBox(player,"["..cl[num].."]不足"..t[2].."个")
        return ""
    end
    if not lualib:SubIngot(player, t[3], "特殊装备锻造", lualib:Name(player)) then
        lualib:MsgBox(player,"元宝不足"..t[3].."个")
        return""
    end
    if  item_site ~= "" then
        if lualib:Item_Destroy(player, item_site, "特殊装备锻造", player) == false then
            lualib:MsgBox(player,"扣除装备失败")
            return""
        end
    end
    if not  lualib:DelItem(player, cl[num], t[2], 2, "特殊装备锻造", "特殊装备锻造") then
        lualib:MsgBox(player,"扣除材料失败")
        return""
    end
    if not lualib:AddItem(player,t[1],1,false,"特殊装备锻造", player) then
        lualib:MsgBox(player,"给予物品失败")
        return""
    end
    lualib:TakeOn(player, t[1])

    local str = "TSSystem_chenggong()";
    lualib:ShowFormWithContent(player, "脚本表单", str);
    huoqu(player,num)
    local s = "#COLORCOLOR_YELLOW#特殊装备#COLORCOLOR_BLUE#：恭喜玩家#COLORCOLOR_ORANGE#「"..lualib:Name(player).."」#COLORCOLOR_BLUE#成功锻造#COLORCOLOR_MAGENTA#["..lualib:KeyName2Name(t[1],4).."]#COLORCOLOR_BLUE#实力大幅提升！！"
    lualib:SysMsg_SendBroadcastColor(s, "", 1, 11)

    return""
end