local lua_path = lualib:IO_GetLuaPath()
local package_path = package.path
package.path = string.format("%s;%s?.lua;%s?", package_path, lua_path, lua_path)

local Item_change = { --物品，可换积分

    {"变异的内丹",1},
    {"BOSS内丹1",10},
    {"BOSS内丹2",20},
    {"BOSS内丹3",30},
    {"精英怪内丹1",1},
    {"精英怪内丹2",2},
    {"精英怪内丹3",3},
    {"祖玛套",3},
    {"赤月套",10},
    {"魔龙套",30},
    {"战神套",70},
    {"韦陀头盔",500},
    {"韦陀腰带",500},
    {"韦陀手镯",500},
    {"韦陀战靴",500},
    {"韦陀项链",500},
    {"韦陀戒指",500},

    {"罗汉头盔",1000},
    {"罗汉腰带",1000},
    {"罗汉手镯",1000},
    {"罗汉战靴",1000},
    {"罗汉项链",1000},
    {"罗汉戒指",1000},

    {"菩提头盔",2000},
    {"菩提腰带",2000},
    {"菩提手镯",2000},
    {"菩提战靴",2000},
    {"菩提项链",2000},
    {"菩提戒指",2000},

    {"圣火头盔",500},
    {"圣火腰带",500},
    {"圣火手镯",500},
    {"圣火战靴",500},
    {"圣火项链",500},
    {"圣火戒指",500},

    {"九阳头盔",1000},
    {"九阳腰带",1000},
    {"九阳手镯",1000},
    {"九阳战靴",1000},
    {"九阳项链",1000},
    {"九阳戒指",1000},

    {"见龙头盔",2000},
    {"见龙腰带",2000},
    {"见龙手镯",2000},
    {"见龙战靴",2000},
    {"见龙项链",2000},
    {"见龙戒指",2000},

    {"阴阳头盔",500},
    {"阴阳腰带",500},
    {"阴阳手镯",500},
    {"阴阳道靴",500},
    {"阴阳项链",500},
    {"阴阳戒指",500},

    {"四象头盔",1000},
    {"四象腰带",1000},
    {"四象手镯",1000},
    {"四象道靴",1000},
    {"四象之链",1000},
    {"四象戒指",1000},

    {"太极头盔",2000},
    {"太极腰带",2000},
    {"太极手镯",2000},
    {"太极道靴",2000},
    {"太极项链",2000},
    {"太极戒指",2000},

    {"九影头盔",500},
    {"九影腰带",500},
    {"九影手镯",500},
    {"九影道靴",500},
    {"九影项链",500},
    {"九影戒指",500},

    {"碧落头盔",1000},
    {"碧落腰带",1000},
    {"碧落手镯",1000},
    {"碧落道靴",1000},
    {"碧落项链",1000},
    {"碧落戒指",1000},
    {"流魂头盔",2000},
    {"流魂腰带",2000},
    {"流魂手镯",2000},
    {"流魂道靴",2000},
    {"流魂项链",2000},
    {"流魂戒指",2000},

    {"神木头盔",500},
    {"神木腰带",500},
    {"神木手镯",500},
    {"神木法靴",500},
    {"神木项链",500},
    {"神木戒指",500},

    {"苍南头盔",1000},
    {"苍南腰带",1000},
    {"苍南手镯",1000},
    {"苍南法靴",1000},
    {"苍南项链",1000},
    {"苍南戒指",1000},

    {"淩烟头盔",2000},
    {"淩烟腰带",2000},
    {"淩烟手镯",2000},
    {"淩烟法靴",2000},
    {"淩烟项链",2000},
    {"淩烟戒指",2000},

    {"落英头盔",500},
    {"落英腰带",500},
    {"落英手镯",500},
    {"落英法靴",500},
    {"落英项链",500},
    {"落英戒指",500},

    {"飘雪头盔",1000},
    {"飘雪腰带",1000},
    {"飘雪手镯",1000},
    {"飘雪法靴",1000},
    {"飘雪项链",1000},
    {"飘雪戒指",1000},

    {"回心头盔",2000},
    {"回心腰带",2000},
    {"回心手镯",2000},
    {"回心法靴",2000},
    {"回心项链",2000},
    {"回心戒指",2000},

}

local Rec_t =
{
    ["祖玛套"] = {"黑铁头盔","绿色项链","力量戒指","骑士手镯","恶魔铃铛","紫碧螺","龙之手镯","灵魂项链","泰坦戒指","三眼手镯","裁决之杖","骨玉权杖","龙纹剑","血饮"},

    ["赤月套"] = {"圣战头盔","圣战项链","圣战手镯","圣战戒指","圣战靴子","圣战勋章","圣战之翼","圣战宝石","圣战守护","圣战腰带","圣战宝甲","天魔神甲","法神头盔","法神项链","法神手镯","法神戒指","法神靴子","法神勋章","法神之翼","法神宝石","法神守护","法神腰带","法神披风","霓裳羽衣","天尊头盔","天尊项链","天尊手镯","天尊戒指","天尊靴子","天尊勋章","天尊宝石","天尊守护","天尊腰带","天尊之翼","天尊之翼","天尊道袍","天师长袍","怒斩","龙牙","逍遥扇"},

    ["魔龙套"] = {"雷霆头盔","雷霆项链","雷霆护腕","雷霆戒指","雷霆靴子","雷霆勋章","雷霆腰带","雷霆之翼","雷霆宝石","雷霆守护","雷霆战甲(男)","雷霆战甲(女)","光芒头盔","光芒项链","光芒护腕","光芒戒指","光芒靴子","光芒勋章","光芒腰带","光芒之翼","光芒宝石","光芒守护","光芒道袍(男)","光芒道袍(女)","烈焰头盔","烈焰项链","烈焰护腕","烈焰戒指","烈焰靴子","烈焰勋章","烈焰腰带","烈焰宝石","烈焰守护","烈焰之翼","烈焰魔衣(男)","烈焰魔衣(女)","屠龙","嗜魂法杖","霸者之刃"},

    ["战神套"] = {"战神之翼","战神守护","战神宝石","战神腰带","战神勋章","战神靴子","战神项链","战神护腕","战神戒指","战神头盔","圣魔之翼","圣魔宝石","圣魔守护","圣魔勋章","圣魔腰带","圣魔头盔","圣魔项链","圣魔护腕","圣魔戒指","圣魔靴子","真魂戒指","真魂护腕","真魂项链","真魂头盔","真魂勋章","真魂腰带","真魂靴子","真魂守护","真魂宝石","真魂之翼","王者战甲(女)","王者道衣(女)","王者法袍(女)","王者法袍(男)","王者道衣(男)","王者战甲(男)","开天","镇天","玄天",
               "强化王者法袍(男)", "强化王者法袍(女)", "强化战神宝石", "强化战神护腕", "强化战神戒指", "强化战神守护", "强化战神勋章", "强化战神腰带", "强化战神头盔", "强化战神靴子", "强化战神项链", "强化圣魔宝石", "强化圣魔护腕", "强化圣魔戒指", "强化圣魔头盔",
               "强化圣魔守护", "强化圣魔靴子", "强化圣魔项链", "强化圣魔勋章", "强化圣魔腰带", "强化真魂宝石", "强化真魂护腕", "强化真魂戒指", "强化真魂头盔", "强化真魂守护", "强化真魂靴子", "强化真魂项链", "强化真魂勋章", "强化真魂腰带",
    }

}

function cailiaoduihuan(player)
    local data = serialize(Item_change)
    lualib:ShowFormWithContent(player,"form文件表单","材料回收#"..data)
    return ""
end

function main(player, hang)

    local num = tonumber(hang)

    local playerName = lualib:KeyName(player)
    local itemCount = 0
    if num > 7 and num < 12 then
        local count = 0
        for k,v in pairs(Rec_t[Item_change[num][1]]) do
            itemCount =lualib:ItemCountEx(player,v,0,false,true,false,false)
            count = count + itemCount
            if itemCount > 0 then
                lualib:DelItem(player,v,itemCount,0,"积分兑换","积分兑换")
                local Integral = itemCount*Item_change[num][2]
                lualib:Player_AddIntegral(player,Integral,"材料","材料")
                lualib:SysMsg_SendPromptMsg(player,"你回收"..v..",获得积分:"..Integral)
                lualib:SysMsg_SendPromptMsg(player,"您当前门派积分是："..lualib:GetIntegral(player))
                lualib:SysMsg_SendBroadcastColor(playerName.."回收:【"..v.."】 * "..tostring(itemCount).." 获得积分："..Integral,"系统",1,12)
            end
        end
        if count == 0 then
            lualib:MsgBox(player,"您没有该类物品！")
            return ""
        end
        return ""
    else

        itemCount = lualib:ItemCountEx(player,Item_change[num][1],0,false,true,false,false)
        --lualib:SysPromptMsg(player,Item_change[num][1])
    end


    if itemCount == 0 then
        lualib:MsgBox(player,"您没有该类物品！")
        return ""
    else

        lualib:DelItem(player,Item_change[num][1],itemCount,0,"积分兑换","积分兑换")
        local Integral = itemCount*Item_change[num][2]
        lualib:Player_AddIntegral(player,Integral,"材料","材料")
        lualib:SysMsg_SendBroadcastColor(playerName.."回收:【"..Item_change[num][1].."】 * "..tostring(itemCount).." 获得积分："..Integral,"系统",1,12)

        lualib:SysMsg_SendPromptMsg(player,"你回收"..Item_change[num][1]..",获得积分:"..Integral)
        lualib:SysMsg_SendPromptMsg(player,"您当前门派积分是"..lualib:GetIntegral(player))
    end
    return ""
end 